Repository: C0ntrolDev/spotify_downloader
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Download from link
ru: Скачать по ссылке

# downloadFromLinkTextFieldHintText
source: Link to a track, playlist, or album
ru: Ссылка на трек, плейлист или альбом

source: Incorrect link
ru: Неправильная ссылка

source: Download liked tracks
ru: Скачать любимые треки

# likedTracksTitle
source: Liked tracks
ru: Любимые треки

source: Active downloads
ru: Активные загрузки

# errorOccurredWhileLoadingActiveDownloads
source: Error occurred while loading active downloads: {failure}
ru: Ошибка загрузки активных треков: {failure}

source: Tracks don't load ^_^
ru: Ничего не загружается ^_^

source: About app
ru: О приложении

source: Special thanks
ru: Благодарности

source: Change the download source
ru: Изменить источник загрузки

source: There's something wrong with connection
ru: С соединением что-то не так

source: Try again
ru: Попробовать снова

# nView
source: {views} views
ru: {views} просмотров

# nThousands
source: {value}K
ru: {value} тыс

# nMillions
source: {value}M
ru: {value} млн

source: Nothing was found at this url
ru: По данному url не было ничего найдено

source: To access you need to Log In
ru: Для доступа необходимо авторизоваться

source: Url copied!
ru: Url скопирован!

source: Link to the source
ru: Ссылка на источник

source: Url not selected
ru: Url не выбран

source: Change the source
ru: Изменить источник

# theTrackIsNotLoaded
source: Track isn't loaded
ru: Трек не загружен

# theTrackIsLoading
source: Track is loading: {percent}%
ru: Трек загружается: {percent}%

# theTrackIsLoaded
source: Track is loaded
ru: Трек загружен

# downloadError
source: Download error: {message}
ru: Ошибка загрузки: {message}

source: no connection
ru: отсутствует соединение

source: Search by name
ru: Поиск по названию

source: Download all
ru: Скачать все

source: Search history
ru: История поиска

# main
source: Home
ru: Главная

source: History
ru: История

source: Grant permissions
ru: Предоставьте разрешения

# storagePermissionText
source: To save music to any location on your phone, the app needs permission to work with the storage
ru: Для сохранения музыки в любое место на вашем телефоне, приложению нужно разрешение на работу с хранилищем

# notificationsPermissionText
source: To notify you of the download, the app needs access to send notifications
ru: Для уведомления вас о загрузки, приложению нужен доступ к отправке уведомлений

source: Grant
ru: Предоставить доступ

source: Refuse
ru: Отказать

source: SpotifySDK and Account
ru: SpotifySDK и Аккаунт

source: Account information is being loaded
ru: Информация об аккаунте загружается

source: You are not logged in to your account
ru: Вы не вошли в аккаунт

source: Unknown error
ru: Неизвестная ошибка

source: Connection error
ru: Ошибка соединения

source: Couldn't log in to your account
ru: Не удалось войти в аккаунт

source: Log in
ru: Войти

source: Log out
ru: Выйти

source: Download
ru: Загрузка

source: Storage path
ru: Место хранения

source: Save all in one folder
ru: Сохранять все в одной папке

source: Settings
ru: Настройки

source: Other
ru: Иное

source: Tracks are being loaded
ru: Идет загрузка треков

source: All tracks are loaded
ru: Все треки загружены

# tracksAreBeingLoadedBody
source: Total: {total} | Loaded: {loaded} | Failured: {failure} | {percent}%
ru: Всего: {total} | Загружено: {loaded} | Ошибка: {failure} | {percent}%

# allTracksAreLoadedBody
source: Loaded: {loaded} | Failured: {failured}
ru: Загружено: {loaded} | Ошибка: {failured}

source: Developed
ru: Разработано

source: Language
ru: Язык

source: You can close the app and the download will continue !
ru: Вы можете закрыть приложение и загрузка продолжится !

source: (you can delete this message)
ru: (вы можете удалить это сообщение)
